config/emacs/config.el
  (setq shell-file-name "/bin/sh"
          vterm-max-scrollback 10000))

(use-package vterm-toggle
        :after vterm
        :config
        (setq vterm-toggle-fullscreen-p nil)
        (setq vterm-toggle-scope 'project)
        (add-to-list 'display-buffer-alist
                '((lambda (buffer-or-name _)
                (let ((buffer (get-buffer buffer-or-name)))
                (with-current-buffer buffer
                    (or (equal major-mode 'vterm-mode)
                        (string-prefix-p vterm-buffer-name (buffer-name))))))
            (display-buffer-reuse-window display-buffer-at-bottom)
            (reusable-framse . visible)
            (window-height . 0.3))))

(use-package yasnippet)
(yas-global-mode 1)

(use-package sudo-edit)

(add-to-list 'custom-theme-load-path "~/.config/emacs/themes/")
(use-package doom-themes
  :config
  (setq doom-themes-enable-bold t
  doom-themes-enable-italic t))
(load-theme 'Euphoria t)
;; fallback theme
;;(use-package catppuccin-theme)
;;(load-theme 'catppuccin :no-confirm)

(use-package tldr)

(set-frame-parameter nil 'alpha-background 70)
(add-to-list 'default-frame-alist '(alpha-background . 70))

(use-package which-key
  :init
    (which-key-mode 1)
  :diminish
  :config
  (setq which-key-side-window-location 'bottom
 	  which-key-sort-order #'which-key-key-order-alpha
 	  which-key-sort-uppercase-first nil
 	  which-key-add-column-padding 1
 	  which-key-max-display-columns nil
 	  which-key-min-display-lines 6
 	  which-key-side-window-slot -10
 	  which-key-side-window-max-height 0.25
 	  which-key-idle-delay 0.8
 	  which-key-max-description-length 25
 	  which-key-allow-imprecise-window-fit nil
 	  which-key-separator " → " ))

(delete-selection-mode 1)    ;; You can select text and delete it by typing.
(electric-pair-mode 1)       ;; Turns on automatic parens pairing
;; The following prevents <> from auto-pairing when electric-pair-mode is on.
;; Otherwise, org-tempo is broken when you try to <s TAB...
(add-hook 'org-mode-hook (lambda ()
           (setq-local electric-pair-inhibit-predicate
                   `(lambda (c)
                  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
(evil-mode 1)
(all-the-icons-ivy-rich-mode 1)
(global-flycheck-mode 1)
(doom-modeline-mode 1)
(persp-mode 1)
(elfeed-goodies/setup)
